Tasks/ПересогласованиеКомпозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>ПересогласованиеКомпозиции</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонструкторКомпозиции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайняяДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конструктор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Tasks/ПересогласованиеКомпозиции/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомплектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектТЗПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
		
		ДанныеКомпозиции = ПолучитьПроектНаСервере(Объект.ОбъектТЗ);
		
		Объект.Проект = ДанныеКомпозиции.Проект;

		Объект.Комплекты.Очистить();
		Для каждого х Из ДанныеКомпозиции.Комплекты Цикл
			ЗаполнитьЗначенияСвойств(Объект.Комплекты.Добавить(), х);
		КонецЦикла;
		
	Иначе
		Объект.Проект = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроектНаСервере(ОбъектТЗ)
	
	Возврат Задачи.ПересогласованиеКомпозиции.ПолучитьПроектНаСервере(ОбъектТЗ);	
	
КонецФункции // ПолучитьПроектНаСервере()


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.ОбъектТЗ.ТолькоПросмотр = НЕ Параметры.Ключ.Пустая();

	Заголовок = Объект.Наименование;
	
	
	Если Копирование Тогда
		Модифицированность 	= Истина;
		Объект.Выполнена 	= Ложь;
		
	ИначеЕсли Объект.Выполнена Тогда
		
		ТолькоПросмотр 							= Истина;
		Элементы.ФормаПринять.Видимость 		= Ложь;
		Элементы.ФормаЗаписатьЗадачу.Видимость 	= Ложь;
		
	КонецЕсли;
	
	ОбновитьСтадии(Неопределено);
	
КонецПроцедуры


Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	омКомментарииНаСервере.СоздатьЭлементыИРеквизитыНаФорме(ЭтаФорма, Элементы.ГруппаКомментарий);
	ДополнительныеПараметры = Неопределено;
	Этаформа.Комментарий_авто = омКомментарииНаСервере.Получить_HTML_комментарий(Объект.Комментарии, , , ДополнительныеПараметры);
	Элементы.ГруппаКомментарий.Заголовок = омКомментарийКлиентСервер.ПолучитьЗаголовокСтраницы(ДополнительныеПараметры);
	
	Копирование = ЗначениеЗаполнено(Параметры.ЗначениеКопирования);
	
КонецПроцедуры 


#Область Комментарии

&НаКлиенте
Процедура ОбщаяКомандаКомментарий(Команда)
	омКомментарииНаКлиенте.ОбщееДействие(ЭтаФорма, ТекущийЭлемент, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяКомандаВсеКомментарии(Команда)
	омКомментарииНаКлиенте.ВсеКомментарий(ЭтаФорма, ТекущийЭлемент);
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПустаяСтрока(ТекущийОбъект.Наименование) Тогда
		ТекущийОбъект.Наименование = ТекущийОбъект.ПолучитьЗаголовок();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда) 
	
	Если ВозвможностьПринятия() Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ВыполнитьНаСервере(Объект.Ссылка);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ВыполнитьНаСервере(СсылкаОбъекта)

	ЗадачаОбъект = СсылкаОбъекта.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецПроцедуры


&НаКлиенте
Функция ВозвможностьПринятия()

	Если Не ЗначениеЗаполнено(Объект.ОбъектТЗ) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнена композиция.";
		Сообщение.Поле 			= "ОбъектТЗ";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Исполнитель) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнен Исполнитель.";
		Сообщение.Поле 			= "Исполнитель";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КонструкторКомпозиции) Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не заполнен конструктор композиции.";
		Сообщение.Поле 			= "КонструкторКомпозиции";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	ВыбранКомплект = Ложь;
	
	Для  х = 0 По Объект.Комплекты.Количество() - 1 Цикл
		
		Если Объект.Комплекты[х].Выбрать Тогда
			
			Если ЗначениеЗаполнено(Объект.Комплекты[х].Конструктор) Тогда
				
				ВыбранКомплект = Истина;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст 		= "Не заполнен конструктор у комплекта " + Объект.Комплекты[х].Комплект + ".";
				Сообщение.Поле 			= "Объект.Комплекты[" + х + "].Комплект";
				Сообщение.ПутьКДанным 	= "Объект";
				Сообщение.Сообщить();
				
				Возврат Ложь;
				
			КонецЕсли;
			
			Если Объект.Комплекты[х].Уконструктора Тогда
			
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст 		= "Комплект " + Объект.Комплекты[х].Комплект + " находится в работе у констурктора.";
				Сообщение.Поле 			= "Объект.Комплекты[" + х + "].Комплект";
				Сообщение.ПутьКДанным 	= "Объект";
				Сообщение.Сообщить();
				
				Возврат Ложь;
				
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ВыбранКомплект Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст 		= "Не выбран ни один комплект.";
		Сообщение.Поле 			= "Объект.Комплекты";
		Сообщение.ПутьКДанным 	= "Объект";
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	
	Возврат Истина;
	
КонецФункции // ВозвможностьПринятия()

&НаКлиенте
Процедура ЗаписатьЗадачу(Команда)
	Записать();
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьСтадииНаСервере(МассивКомплектов)
	Возврат омЗадачиРКДНаСервере.ЗадачиУКонструктора(МассивКомплектов);
КонецФункции

&НаКлиенте
Процедура ОбновитьСтадии(Команда)
	
	МассивКомплектов = Новый Массив;
	Для каждого х Из Объект.Комплекты Цикл
		МассивКомплектов.Добавить(х.Комплект);	
	КонецЦикла;
		
	СтадииКомплектов = ОбновитьСтадииНаСервере(МассивКомплектов);
	
	Для каждого ТекущийКомплект Из Объект.Комплекты Цикл
		
		ТекущийКомплект.ТекущаяСтадия 			= "";
		ТекущийКомплект.УКонструктора 	= Ложь;
		
		Для каждого ТекущаяСтадия Из СтадииКомплектов Цикл
			
			Если ТекущаяСтадия.ОбъектТЗ = ТекущийКомплект.Комплект Тогда
				
				ТекущийКомплект.ТекущаяСтадия = ТекущаяСтадия.ТекущаяСтадия;		
				ТекущийКомплект.УКонструктора = ТекущаяСтадия.УКонструктора;		
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектыПередНачаломИзменения(Элемент, Отказ)
	
	ТД = Элементы.Комплекты.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если Элементы.Комплекты.ТекущийЭлемент.Имя = "КомплектыКомплект" Тогда
		
		Отказ = Истина;
		ПоказатьЗначение(, ТД.Комплект);
		
	Иначе
		
		Если ТД.УКонструктора Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
